#define d_TRACE 1
#include "global.h"
/*  This is the trace routine.  Trace data is written to a circular ram buffer and can be displayed to the HI terminal.
*/

uint32 *trace_ptr[10];
char trace_name[10][11];
uint8 trace_record_fault[10];
int16 trace_status[10];
int16 trace_format[10];
int16 trace_auto_start; 		// variable to start trace automatically on power up
uint32 trace_offset[10];
uint32 trace_mask[10];

uint32 tr_data[6] = {0,0,0,0,0,0};
uint32 Trace_pix = 0;
uint32 Trace_gix = 0;

#define max_trace_size 100
//uint32 Trace_Data[max_trace_size][6]; 
uint8 trace_update = 0;
uint8 run_trace = 0;
uint8 trace_complete = 0;
uint8 trace_routine[max_trace_size];
uint16 trace_clock[max_trace_size];

void write_trace (uint8 routine);
void set_mask (int16 num);
void Write_System_Trace(void);		   // Write to next location in memory	
void init_debug_trace (void);
void start_debug_trace (void);
void clear_debug_trace(void);
void clear_trigger_logic (void);
void start_trace (void);

enum 
{
	TR_NOTRACE,
	TR_ATFLOOR1,
	TR_ATFLOOR2,
	TR_ATFLOOR3,
	TR_ATFLOOR4,
	TR_CHKRUN1,
	TR_CHKRUN2,
	TR_DIRSEL,
	TR_HYDRO_CONTROL,
	TR_STATUS_CONTROL,
	TR_OUTPUT_CONTROL,
	TR_SET_GRP_IO,
	TR_COMM_CONTROL,
	TR_DOOR_CONTROL,
	TR_LIGHT_BUZZER_CONTROL,
	TR_CHK_MOTION_FAULT1,
	TR_CHK_MOTION_FAULT2,
	TR_CHK_MOTION_FAULT3,
	TR_CHK_MOTION_FAULT4,
	TR_SECURITY_CONTROL,
	TR_HOISTWAY_CONTROL,
	TR_INCTIME1,
	TR_INCTIME2,
	TR_INCTIME3,
	TR_INCTIME4,
	TR_MOTION1,
	TR_MOTION2,
	TR_MOTION3,
	TR_MOTION4,

					record_fault(f_trace);
				}
			}

			if (trace_status[3] == 1)
			{
				Trace_Data[Trace_pix][3] = (uint32) *trace_ptr[3] & trace_mask[3];
				tr_data[3] = ((uint32) *trace_ptr[3]) & trace_mask[3];
				if (trace_record_fault[3] == 1)
				{
					fault_prog_flag1 = trace_routine[Trace_pix];
					fault_prog_flag2 = (uint8)trace_clock[Trace_pix];
					fault_device_2 = 4;
					record_fault(f_trace);
				}
			}

			if (trace_status[4] == 1)
			{
				Trace_Data[Trace_pix][4] = (uint32) *trace_ptr[4] & trace_mask[4];
				tr_data[4] = ((uint32) *trace_ptr[4]) & trace_mask[4];
			}

			if (trace_status[5] == 1)
			{
				Trace_Data[Trace_pix][5] = ((uint32) *trace_ptr[5]) & trace_mask[5];
				tr_data[5] = ((uint32) *trace_ptr[5]) & trace_mask[5];
			}
			
			if (Trace_pix < (max_trace_size - 1))
				Trace_pix++;
			else
				trace_complete = 1;
		}
	}
*/	
}

void init_debug_trace (void)
{
/*
#if (Traction == 1)
	trace_ptr[0] = (uint32 *)(&DPP_UT[0]); 
    trace_ptr[1] = (uint32 *)(&DPP_UT[1]); 
    trace_ptr[2] = (uint32 *)(&DPP_DT[0]); 
    trace_ptr[3] = (uint32 *)(&DPP_DT[1]); 
    strncpy(trace_name[0],"UT \0",4);
    strncpy(trace_name[1],"UT1\0",4);
    strncpy(trace_name[2],"DT \0",4);
    strncpy(trace_name[3],"DT1\0",4);
    trace_format[0] = 'I';
    trace_mask[0] = 0xFFFFFFFF;
	trace_status[0] = 1;
 	trace_record_fault[0] = 0;
    trace_format[1] = 'I';
    trace_mask[1] = 0xFFFFFFFF;
	trace_status[1] = 1;
 	trace_record_fault[1] = 0;
    trace_format[2] = 'I';
    trace_mask[2] = 0xFFFFFFFF;
	trace_status[2] = 1;
 	trace_record_fault[2] = 0;
    trace_format[3] = 'I';
    trace_mask[3] = 0xFFFFFFFF;
	trace_status[3] = 1;
 	trace_record_fault[3] = 0;
#endif
*/
}

void start_debug_trace (void)
{
/*
	Trace_pix = 0;
	Trace_gix = 0;
	run_trace = 1;
	trace_update = 1;
	trace_complete = 0;
	trace_tmr = 0;
*/	
}

void clear_debug_trace(void)
{
/*
	int i = 0;
	int j = 0;
	for (j=0;j<=5;j++)
	{
		trace_status[j] = 0;
 		trace_record_fault[j] = 0;
		trace_mask[j] = 0;
		tr_data[j] = 0;
		for (i=0;i<max_trace_size;i++)
			Trace_Data[i][j] = 0;
	}
	Trace_gix = 0;
	Trace_pix = 0;
	trace_complete = 0;
	run_trace = 0;
	trace_auto_start = 0;
*/	
}

void set_mask (int16 num)
{
/*
	switch (trace_format[num])
	{
		case 'D':
			trace_mask[num] = 0xFFFFFFFF;
			break;
		case 'B':
			trace_mask[num] = 0xFF000000;
			break;
		case 'H':
			trace_mask[num] = 0xFF000000;
			break;
		case 'W':
			trace_mask[num] = 0xFFFF0000;
			break;
		case 'S':		// Short Integer 16 bits
			trace_mask[num] = 0xFFFF0000;
			break;
		case 'X':
			trace_mask[num] = 0xFFFFFFFF;
			break;
		case 'I':	// Integer 32 bits
			trace_mask[num] = 0xFFFFFFFF;
			break;
		case 'U':
			trace_mask[num] = 0xFFFFFFFF;
			break;
		case 'C':
			trace_mask[num] = 0xFF000000;
			break;
		case 'L':			  
			trace_mask[num] = 0xFFFFFFFF;
			break;
		case 'E':
			trace_mask[num] = 0xFFFFFFFF;
			break;
		case 'F':
			trace_mask[num] = 0xFFFFFFFF;
			break;
		default:
			trace_mask[num] = 0xFFFFFFFF;
			break;
	}  
*/	
}

/*

typedef struct System_Trace {
	uint16 code;			// 0,1
	uint8 count;			// 2
	uint8 day;				// 3
	uint8 mon;				// 4
	int16 year;				// 5,6
	uint8 min;				// 7
	uint8 hour;				// 8
	uint8 sec;				// 9
	uint8 pos;				// 10
	uint8 servf;			// 11	  
	uint8 procf;			// 12	  
	uint8 doorf;			// 13
	uint8 rdoorf;			// 14
	uint8 dpref;			// 15
	uint8 dirf;				// 16
	uint8 empf;				// 17
	uint8 medf;				// 18
	uint8 codebf;			// 19
	uint8 eqf;				// 20
	uint8 firef;			// 21	   
	uint8 rfiref;			// 22
	uint8 hsf;				// 23
	uint8 startf;		   	// 24
	uint8 dcalls;   		// 25
	uint8 estop;			// 26
	uint8 nstopf;			// 27
	uint8 relevel;			// 28
	uint8 stepf;			// 29
	uint8 door_seqf;		// 30
	uint8 next_stop;		// 31   
	uint8 ins_status;		// 32  
	uint8 ncu_door_seq;		// 33
	uint8 device;			// 34
	uint8 prog_flag1;		// 35
	uint8 prog_flag2;		// 36
	uint8 device_2;			// 37
	uint8 iodata [30];		// 38-67
	int32 statusf;			// 68-71
	int32 dpp_count;	 	// 72-75
	int32 sd_count;		// 76-79
	int16 vel_fpm;	 		// 80-81
	int16 dmd_vel_fpm;		// 82-83
	int16 drv_vel_fpm;		// 84-85
	int16 enc_vel_fpm;		// 86-87
	uint8 SPB_service;		// 88
	uint8 SPB_status;		// 89
	int16 SPB_vel;			// 90-91
	int32 SPB_poscnt;		// 92-95
	uint16 SPB_command;		// 96-97
	uint8 SPB_ios[5];		// 98-102

	uint8 fault_bits[4];	// 103-106
	int32 statusf2;			// 107-110
	int16 ss_status;		// 111-112
	int16 power_status;		// 113-114
	int16 NTS_vel;			// 115-116
	uint8 NTS_service;		// 117
	uint8 NTS_status;		// 118
	uint8 NTS_command;		// 119
	uint8 NTS_limit_flt[3];	// 120-122
	uint8 NTS_ios[3];		// 123-125	 keep an even number
	uint32 run_statusf;		// 126-129
 	uint8 nudgst_flags;		// 130		Nudging_Flags = rnudgst, nudgst
	uint8 door_req_flags;	// 131 		Door Request = rdoor_en, rcc_req, rdob_req, rdoor_req, fdoor_en, fcc_req, fdob_req, fdoor_req
	uint8 call_flags;		// 132 		Call_Flags = onward_hc, onward_cc, onward_calls, dcalls 
	uint8 chkrun_st;		// 133
	uint8 chkstart_st;		// 134
	uint8 chklevel_st;		// 135
	uint8 chkdoor_st;		// 136
	uint16 front_sd;		// 137-138
	uint16 rear_sd;			// 139-140
	uint16 motion_tmr;		// 141-142
	int16 PAL_vel;			// 143-144
	uint8 PAL_stat;			// 145
	uint8 ins_servf; 		// 146
	uint8 enc_dir;			// 147
	uint16 drv_cmd;			// 148-149
	uint16 drv_status;		// 150-151
	uint16 drv_mtr_torque;	// 152-153
	uint16 drv_torque_cmd;	// 154-155
	uint16 percent_load;	// 156-157
	uint8 lev_startf;		// 158
	uint8 spare;			// 159
} System_Trace_type;		// 160 * 450 = 72000 bytes




	uint8 enc_dir;			// 148
*/

#define max_trace_ix 500

struct Fault S_Trace[max_trace_ix + 1];

uint16 Trace_ix = 0;
uint8 Trace_Stop = 0;
uint8 Trace_Trigger = 0;
uint8 trace_stop_cnt = 0;
uint16 trace_cnt = 0;
uint16 trace_stop_ix = 0;


uint16 st_cur_flt = 0;
uint16 st_servf = 0;
uint16 st_procf = 0;
uint16 st_front_sd = 0;		
uint16 st_rear_sd = 0;	
uint32 st_run_statusf = 0;		
uint32 st_statusf = 0;
uint32 st_statusf2 = 0;
uint32 st_statusf3 = 0;
uint32 st_statusf4 = 0;
uint8  st_nts_status1 = 0;
uint8  st_nts_status2 = 0;
uint16  st_nts_command1 = 0;
uint8  st_nts_command2 = 0;
uint8  st_nts_doorzone = 0;
uint8  st_nts_limits = 0;
uint8 st_fault_bits[4] = {0,0,0,0};

uint32 trigger_logic = 0;					// adjustable variable
uint32 and_trigger_logic = 0;				// adjustable variable
uint32 trigger_enable = 0;					// adjustable variable

#define 	DELTA_FAULT		0x00000001		// fault change
#define		MATCH_FAULT		0x00000002		// fault match
#define		DELTA_SERVF		0x00000004		// servf change
