// This is the main control program for hydro and traction cars.
// This version is used for ANSI 2000 Compliant boards only.

#define SLC386 0
#define Security 0	     // Full blown security
#define auto_elevator 0	// set to a zero if not automatic elevator

#define d_CONTROL 1
#include "global.h"


// ZYM 12-1-2017 work as cedes head
#include "cedes_can.h"


#define Hollister 0

#define CR 13
#define LF 10
#define ESC 27
  
extern uint8 Enable_CAN_Ctrl;
extern uint8 Enable_CT_CAN_Ctrl; // disable while doing Car Top CAN test (wbg)
extern uint8 Enable_MR_CAN_Ctrl; // disable while doing Machine Room CAN test (wbg)
extern uint8 Enable_gr_CAN_Ctrl;
extern uint8 Enable_RS232_Ctrl; 
extern uint8 Enable_RS485_Ctrl;
extern uint8 Enable_iospi_Ctrl;
extern uint8 Enable_Hallcom_Ctrl;
extern void CAN_Control(void);
extern void CAN_Init(void);
extern int UpdateAllSEB(void);
extern void ReadAllSEB(void);
extern void i1spi_pack (void);
extern void nts_spi_pack (uint8 msg);
extern void i1spi_unpack (void);
extern void iospi_unpack (void);
extern void nts_spi_unpack (void);
extern void iospi_pack (void);
  
int32 start_int = 0;

int16 led_stat = 0;

uint32 cons_date_code = 0;

int32 debug1 = 0;
int32 debug2 = 0;
int32 debug3 = 0;
int32 debug4 = 0;
int32 debug5 = 0;
int32 debug6 = 0;
int32 debug7 = 0;
int32 debug8 = 0;

uint8 chkrun_state = 0;
uint8 chkstart_state = 0;
uint8 chklevel_state = 0;
uint8 chkdoor_state = 0;

uint8 Timer_tic = 0;  // tagwbg 02 - Timer_tic gets set in timer

int16 limit_fault=0;			// UT,UTS,DT or DTS limit fault
int16 fault[25];  		    // fault buffer holds the faults
int16 old_fault[25];
int16 ins_fault = 0;			// inspection fault flag
int16 ins_fault_latch = 0;	// inspection fault latch
int16 ins_sw_err = 0;			// inspection switch error (up or down run)
int16 ins_status = 0;			// inspection status
								// bit 0: INS (car top inspection)
								// bit 1: MRIN (machine room inspection)
								// bit 2: ACC (access)
								// bit 3: ICI (in car inspection)
								// bit 4; LBP (lock bypass)
								// bit 5: GBP (gate bypass)
								// bit 6: AUTO (automatic)
int16 byp_fault = 0;			// gate or lock bypass fault
int16 byp_fault_latch = 0;	// gate or lock bypass fault latch
int16 gripper_test = 0;		// State flag for gripper test
int16 in_gripper_test = 0;	// In gripper test routine
int16 gripper_fault = 0;		// Rope gripper fault
int16 old_gripper_fault = 0;	// gripper fault memory
int16 gripper_trip_enable = 0; 	// gripper trip enable flag
int16 DBR_Temp_Fault = 0;		// Dynamic Braking Temperature Fault
int16 fault_device = 0;		// device that had the fault
int16 fault_device_2 = 0;		// device 2 that had the fault
int16 fault_prog_flag1 = 0;	// programmer multi-use flag 1
int16 fault_prog_flag2 = 0;	// programmer multi-use flag 2
int16 motion_fault = 0;		// Motion fault occurred: must stop car
int16 redundancy_test = 0;		// redundancy relay test
int16 in_redundancy_test = 0;	// in redundancy relay test
int16 reset_courion = 0;
int16 hydro_on_emp = 0;		// hydro on emergency power
int16 prev_hydro_on_emp = 0;	// previous flag for hydro on emergency power
int16 in_serv_lt = 0;			// in service light control for single automatic pushbutton operation
int16 oserl_enable = 0;		// Special Out of Service Light enable variable
int16 oser_lt = 0;			// Out of service light
int16 oser_bz = 0;			// Out of service buzzer
int16 oser_bz_pulse = 0;		// Out of service buzzer flash
int16 hardware_init_fault = 0;	// 1 if hardware failed on init
int16 drv_rst_cnt = 0;		// Counter for drive ready reset
int16 rdy_flt_latch = 0;		// fault latch for drive ready
bool ResetFaults = false;
int16 cen_fault = 0;		// CEN input fault
int16 door_motor_ovl = 0;		// Door motor overload flag
int16 safe_fault_latch = 0;	// safe fault latch
int16 eef2_enabled = 0;			// set when secondary electric eye input is enabled
int16 eer2_enabled = 0;			// set when secondary rear electric eye input is enabled
int16 fado_fault_cnt = 0;		// front auto swing hall door open fault count
int16 rado_fault_cnt = 0;		// rear auto swing hall door open fault count


//**************************************************************************
//**************************************************************************
// NOTE: Keep fault type to an even number because MRAM writes are word wide
//**************************************************************************
//**************************************************************************

int16 car_has_fault = 0;

typedef struct Fault {
	uint16 code;			// 0,1
	uint8 count;			// 2
	uint8 day;				// 3
	uint8 mon;				// 4
	int16 year;				// 5,6
	uint8 min;				// 7
	uint8 hour;				// 8
	uint8 sec;				// 9
	uint8 pos;				// 10
	uint8 servf;			// 11	  
	uint8 procf;			// 12	  
	uint8 doorf;			// 13
	uint8 rdoorf;			// 14
	uint8 dpref;			// 15
	uint8 dirf;				// 16
	uint8 empf;				// 17
	uint8 medf;				// 18
	uint8 codebf;			// 19
	uint8 eqf;				// 20
	uint8 firef;			// 21	   
	uint8 rfiref;			// 22
	uint8 hsf;				// 23
	uint8 startf;		   	// 24
	uint8 dcalls;   		// 25
	uint8 estop;			// 26
	uint8 nstopf;			// 27
	uint8 relevel;			// 28
	uint8 stepf;			// 29
	uint8 door_seqf;		// 30
	uint8 next_stop;		// 31   
	uint8 ins_status;		// 32  
	uint8 ncu_door_seq;		// 33
	uint8 device;			// 34
	uint8 prog_flag1;		// 35
	uint8 prog_flag2;		// 36
	uint8 device_2;			// 37
	uint8 iodata [30];		// 38-67
	int32 statusf;			// 68-71
	int32 dpp_count;	 	// 72-75
	int32 sd_count;			// 76-79
	int16 vel_fpm;	 		// 80-81
	int16 dmd_vel_fpm;		// 82-83
	int16 drv_vel_fpm;		// 84-85
	int16 enc_vel_fpm;		// 86-87
	
	uint8 NTS_status1;		// 88
	uint8 NTS_status2;		// 89
	int16 NTS_vel;			// 90-91
	int32 NTS_poscnt;		// 92-95
	uint8 NTS_command1;		// 96
	uint8 NTS_command2;		// 97
	uint8 NTS_doorzone;		// 98
	uint8 NTS_limits;		// 99
	uint8 NTS_vel_dir;		// 100
	uint8 unused1;			// 101
	uint8 unused2;			// 102

	uint8 fault_bits[4];	// 103-106
	int32 statusf2;			// 107-110
	int16 ss_status;		// 111-112
	int16 power_status;		// 113-114
	
	int32 fl_dpp_count;		// 115-118
	uint8 unused7;			// 119
	uint8 unused8;			// 120
	uint8 unused9;			// 121
	uint8 unused10;			// 122
	uint8 unused11;			// 123
	uint8 unused12;			// 124
	uint8 unused13;			// 125

	uint32 run_statusf;		// 126-129
 	uint8 nudgst_flags;		// 130		Nudging_Flags = rnudgst, nudgst
	uint8 door_req_flags;	// 131 		Door Request = rdoor_en, rcc_req, rdob_req, rdoor_req, fdoor_en, fcc_req, fdob_req, fdoor_req
	uint8 call_flags;		// 132 		Call_Flags = onward_hc, onward_cc, onward_calls, dcalls 
	uint8 chkrun_st;		// 133
	uint8 chkstart_st;		// 134
	uint8 chklevel_st;		// 135
	uint8 chkdoor_st;		// 136
	uint16 front_sd;		// 137-138
	uint16 rear_sd;			// 139-140
	uint16 motion_tmr;		// 141-142
	int16 PAL_vel;			// 143-144
	uint8 PAL_stat;			// 145
	uint8 ins_servf; 		// 146
	uint8 enc_dir;			// 147
	uint16 drv_cmd;			// 148-149
	uint16 drv_status;		// 150-151
	uint16 drv_mtr_torque;	// 152-153
	uint16 drv_torque_cmd;	// 154-155
	uint16 percent_load;	// 156-157
	uint8 lev_startf;		// 158
	int32 statusf3;			// 159-162
	int32 statusf4;			// 163-166
	uint8 spare;			// 167		even number
} Fault_type;				// 168 * 50 = 8400 bytes

#define max_flt_ix 50
union fault_union {
	uint8 fltb[max_flt_ix][sizeof(Fault_type)];
	uint16 fltw[max_flt_ix][sizeof(Fault_type)/2];
	struct Fault Flts[max_flt_ix];
}f;

union car_fault_union {
	uint8 fltb[max_flt_ix][sizeof(Fault_type)];
	uint16 fltw[max_flt_ix][sizeof(Fault_type)/2];
	struct Fault Flts[max_flt_ix];
}cf;

int16 Flt_ix = 0;
int16 Car_Flt_ix = 0;
	 
#define f_reset 1						// 001F - Reset failure
#define f_pos_error 2					// 002F - Elevator lost failure (position error)
#define f_binary 3						// 003F - Binary floor input failure
#define f_sstring 4						// 004F - Safety string failure or no P
#define f_dz_on 5						// 005F - Door zone on failure
#define f_stall_fault 6					// 006F - Stall failure
#define f_door_open 7					// 007F - Door open failure
#define f_door_close 8					// 008F - Door close failure
