// external global variables Global.h

#define SLC386 0
#define Stop_At_Lobby 0
#define Security 0
#define PEAK 1
#define auto_elevator 0

#define CR 0x0D
#define LF 0x0A
#define ESC 27

extern int16 start_int;
extern const int8 version;
extern const int8 revision;
extern const int8 interim_revision;
extern const int8 Sandbox_revision;

extern uint32 cons_date_code;

// Debug data
extern int32 debug1;
extern int32 debug2;
extern int32 debug3;
extern int32 debug4;
extern int32 debug5;
extern int32 debug6;
extern int32 debug7;
extern int32 debug8;

extern uint8 chkrun_state;
extern uint8 chkstart_state;
extern uint8 chklevel_state;
extern uint8 chkdoor_state;

extern uint8 Timer_tic;

extern int16 int_flag;
extern int16 int_err;
extern int16 ir_mask_1;
extern int16 ir_mask_2;
extern int16 dpy_io_data;

extern int16 DIO1_in;
extern int16 DIO2_out;

extern uint32 inctim_time;
extern uint32 inctim_min;
extern uint32 inctim_max;
extern uint32 inctim_avg;
extern uint32 inctim_now;
extern uint32 proctim_min;
extern uint32 proctim_max;
extern uint32 proctim_avg;
extern uint32 proctim_now;

extern uint8 pwr_up_init;				// flag that control software has been initialized on power up

extern int16 remote_cc;
extern int16 remote_rcc;
extern unsigned char misc_io_data;


// Timers used throught the program
extern int16 cctim[fl_size];          // car call timers
extern int16 ccrtim[fl_size];          // car call timers

enum {
 tinc,          	// Time generated from the 1/100 sec interupt

extern uint8 Door_DPM_rear_fault;		// Door DPM fault if dpm is on when door are open - rear

extern uint8 Door_DPM_seq_fault;		//  Door DPM fault if dpm sequence failed
extern uint8 Door_DPM_seq_front_fault;	//  Door DPM fault if dpm sequence failed - front
extern uint8 Door_DPM_seq_rear_fault;	//  Door DPM fault if dpm sequence failed - rear

extern int16 DZ_ON_Fault;
extern int16 DZA_ON_Fault;
extern int16 DZ_OFF_Fault;
extern int16 DZA_OFF_Fault;
extern int16 DZsn_OFF_Fault;		// Door zone sn (selector) off fault
extern int16 UL_ON_Fault;			// Detect if UL does not turn off during motion
extern int16 DL_ON_Fault;			// Detect if DL does not turn off during motion
extern int16 UL_DL_OFF_Fault;		// UL or DL did not turn on at level zone
extern int16 io_fault;			// Io device fault
extern int16 io_fault_cnt;		// Lock up after 3 io faults
extern int16 limit_fault;			// UT,UTS,DT or DTS limit fault
extern int16 ins_fault;			// inspection fault flag
extern int16 ins_fault_latch;		// inspection fault latch
extern int16 ins_sw_err;			// inspection switch error (up or down run)
extern int16 ins_status;			// inspection status
extern int16 byp_fault;			// gate or lock bypass fault
extern int16 byp_fault_latch;		// gate or lock bypass fault latch
extern int16 gripper_test;		// State flag for gripper test
extern int16 in_gripper_test;		// In gripper test routine
extern int16 gripper_fault;		// Rope gripper fault
extern int16 gripper_trip_enable; 	// gripper trip enable flag
extern int16 DBR_Temp_Fault;		// Dynamic Braking Temperature Fault
extern int16 fault_device;		// device that had the fault
extern int16 fault_device_2;		// device 2 that had the fault
extern int16 fault_prog_flag1;	// programmer multi-use flag 1
extern int16 fault_prog_flag2;	// programmer multi-use flag 2
extern int16 motion_fault;		// Motion fault occurred: must stop car
extern int16 redundancy_test;			// redundancy relay test
extern int16 in_redundancy_test;			// in redundancy relay test
extern int16 reset_courion;
extern int16 in_serv_lt;			// in service light control for single automatic pushbutton operation
extern int16 oserl_enable;		// Special Out of Service Light enable variable
extern int16 oser_lt;				// Out of service light
extern int16 oser_bz;				// Out of service buzzer
extern int16 oser_bz_pulse;		// Out of service buzzer flash
extern int16 hardware_init_fault;	// 1 if hardware failed on init
extern int16 drv_rst_cnt;			// Counter for drive ready reset
extern int16 rdy_flt_latch;		// fault latch for drive ready
extern bool ResetFaults;
extern int16 cen_fault;		// CEN input fault
extern int16 door_motor_ovl;		// Door motor overload flag
extern int16 safe_fault_latch;	// safe fault latch
extern int16 eef2_enabled;			// set when secondary electric eye input is enabled
extern int16 eer2_enabled;			// set when secondary rear electric eye input is enabled 
extern int16 fado_fault_cnt;		// front auto swing hall door open fault count
extern int16 rado_fault_cnt;		// rear auto swing hall door open fault count

extern int16 car_has_fault;

typedef struct Fault {
	uint16 code;			// 0,1
	uint8 count;			// 2
	uint8 day;				// 3
	uint8 mon;				// 4
	int16 year;				// 5,6
	uint8 min;				// 7
	uint8 hour;				// 8
	uint8 sec;				// 9
	uint8 pos;				// 10
	uint8 servf;			// 11	  
	uint8 procf;			// 12	  
	uint8 doorf;			// 13
	uint8 rdoorf;			// 14
	uint8 dpref;			// 15
	uint8 dirf;				// 16
	uint8 empf;				// 17
	uint8 medf;				// 18
	uint8 codebf;			// 19
	uint8 eqf;				// 20
	uint8 firef;			// 21	   
	uint8 rfiref;			// 22
	uint8 hsf;				// 23
	uint8 startf;		   	// 24
	uint8 dcalls;   		// 25
	uint8 estop;			// 26
	uint8 nstopf;			// 27
	uint8 relevel;			// 28
	uint8 stepf;			// 29
	uint8 door_seqf;		// 30
	uint8 next_stop;		// 31   
	uint8 ins_status;		// 32  
	uint8 ncu_door_seq;		// 33
	uint8 device;			// 34
	uint8 prog_flag1;		// 35
	uint8 prog_flag2;		// 36
	uint8 device_2;			// 37
	uint8 iodata [30];		// 38-67
	int32 statusf;			// 68-71
	int32 dpp_count;	 	// 72-75
	int32 sd_count;		// 76-79
	int16 vel_fpm;	 		// 80-81
	int16 dmd_vel_fpm;		// 82-83
	int16 drv_vel_fpm;		// 84-85
	int16 enc_vel_fpm;		// 86-87
	
	uint8 NTS_status1;		// 88
	uint8 NTS_status2;		// 89
	int16 NTS_vel;			// 90-91
	int32 NTS_poscnt;		// 92-95
	uint8 NTS_command1;		// 96
	uint8 NTS_command2;		// 97
	uint8 NTS_doorzone;		// 98
	uint8 NTS_limits;		// 99
	uint8 NTS_vel_dir;		// 100
	uint8 unused1;			// 101
	uint8 unused2;			// 102

	uint8 fault_bits[4];	// 103-106
	int32 statusf2;			// 107-110
	int16 ss_status;		// 111-112
	int16 power_status;		// 113-114
	
	int32 fl_dpp_count;		// 115-118
	uint8 unused7;			// 119
	uint8 unused8;			// 120
	uint8 unused9;			// 121
	uint8 unused10;			// 122
	uint8 unused11;			// 123
	uint8 unused12;			// 124
	uint8 unused13;			// 125
	
	uint32 run_statusf;		// 126-129
 	uint8 nudgst_flags;		// 130		Nudging_Flags = rnudgst, nudgst
	uint8 door_req_flags;	// 131 		Door Request = rdoor_en, rcc_req, rdob_req, rdoor_req, fdoor_en, fcc_req, fdob_req, fdoor_req
	uint8 call_flags;		// 132 		Call_Flags = onward_hc, onward_cc, onward_calls, dcalls 
	uint8 chkrun_st;		// 133
	uint8 chkstart_st;		// 134
	uint8 chklevel_st;		// 135
	uint8 chkdoor_st;		// 136
	uint16 front_sd;		// 137-138
	uint16 rear_sd;			// 139-140
	uint16 motion_tmr;		// 141-142
	int16 PAL_vel;			// 143-144
	uint8 PAL_stat;			// 145
	uint8 ins_servf; 		// 146
	uint8 enc_dir;			// 147
	uint16 drv_cmd;			// 148-149
	uint16 drv_status;		// 150-151
	uint16 drv_mtr_torque;	// 152-153
	uint16 drv_torque_cmd;	// 154-155
	uint16 percent_load;	// 156-157
	uint8 lev_startf;		// 158
	int32 statusf3;			// 159-162
	int32 statusf4;			// 163-166
	uint8 spare;			// 167		even number
} Fault_type;				// 168 * 50 = 8400 bytes

#define max_flt_ix 50
extern union fault_union {
	unsigned char fltb[max_flt_ix][sizeof(Fault_type)];
	uint16 fltw[max_flt_ix][sizeof(Fault_type)/2];
	struct Fault Flts[max_flt_ix];
}f;

extern union car_fault_union {
	unsigned char fltb[max_flt_ix][sizeof(Fault_type)];
	uint16 fltw[max_flt_ix][sizeof(Fault_type)/2];
	struct Fault Flts[max_flt_ix];
}cf;

extern int16 Flt_ix;
extern int16 Car_Flt_ix;

#define f_reset 1						// 001F - Reset failure
#define f_pos_error 2					// 002F - Elevator lost failure (position error)
#define f_binary 3						// 003F - Binary floor input failure
#define f_sstring 4						// 004F - Safety string failure or no P
#define f_dz_on 5						// 005F - Door zone on failure
#define f_stall_fault 6					// 006F - Stall failure
#define f_door_open 7					// 007F - Door open failure
